{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv3D", "config": {"padding": "valid", "strides": [1, 1, 1], "kernel_regularizer": null, "batch_input_shape": [null, 64, 64, 64, 1], "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "name": "conv3d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [12, 12, 12], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "filters": 8, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2, 2], "pool_size": [2, 2, 2], "data_format": "channels_last", "name": "max_pooling3d_1"}}, {"class_name": "Conv3D", "config": {"padding": "valid", "strides": [1, 1, 1], "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_size": [6, 6, 6], "name": "conv3d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Conv3D", "config": {"padding": "valid", "strides": [1, 1, 1], "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_size": [2, 2, 2], "name": "conv3d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2, 2], "pool_size": [2, 2, 2], "data_format": "channels_last", "name": "max_pooling3d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "units": 2, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "softmax"}}], "keras_version": "2.0.2"}