{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "Conv3D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [1, 1, 1], "dtype": "float32", "name": "conv3d_1", "kernel_size": [8, 8, 8], "trainable": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "batch_input_shape": [null, 64, 64, 64, 1]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}}, {"class_name": "MaxPooling3D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling3d_1", "strides": [2, 2, 2], "pool_size": [2, 2, 2], "trainable": true}}, {"class_name": "Conv3D", "config": {"activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "strides": [1, 1, 1], "filters": 8, "name": "conv3d_2", "kernel_size": [4, 4, 4], "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Conv3D", "config": {"activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "strides": [1, 1, 1], "filters": 8, "name": "conv3d_3", "kernel_size": [2, 2, 2], "trainable": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "config": {"scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "MaxPooling3D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling3d_2", "strides": [2, 2, 2], "pool_size": [2, 2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 2, "name": "dense_1", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_2"}}]}