{"config": [{"config": {"filters": 8, "padding": "valid", "data_format": "channels_last", "batch_input_shape": [null, 64, 64, 64, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "kernel_size": [8, 8, 8], "activation": "relu", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1, 1], "name": "conv3d_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1e-05, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_1", "axis": 1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2, 2], "name": "max_pooling3d_1", "pool_size": [2, 2, 2], "trainable": true}, "class_name": "MaxPooling3D"}, {"config": {"filters": 8, "padding": "valid", "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "kernel_size": [14, 14, 14], "activation": "relu", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1, 1], "name": "conv3d_2", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1e-05, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_2", "axis": 1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"filters": 8, "padding": "valid", "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "kernel_size": [4, 4, 4], "activation": "linear", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1, 1], "name": "conv3d_3", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1e-05, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_3", "axis": 1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_2", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"filters": 8, "padding": "valid", "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "kernel_size": [2, 2, 2], "activation": "relu", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1, 1], "name": "conv3d_4", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1e-05, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_4", "axis": 1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_3", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2, 2], "name": "max_pooling3d_2", "pool_size": [2, 2, 2], "trainable": true}, "class_name": "MaxPooling3D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_4", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_2", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}